// – є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код, який буде присвоювати змінній х значення “default”,
// якщо ви намагаєтесь присвоїти в неї falsy-значення (хибноподібні, тобто ті, які приводиться
// до false, а це 0 null undefined і тд).
let x = '0';

if (!x) {
    x = 'default';
}
console.log(x);
//  мені в цьому прикладі не зрозуміло, як ввести х через prompt. Коли ми вводимо 0 число, то виводиться '0' строка.
// якщо  зробимо +prompt('Enter any value') то виводиться NaN при введені строки.
//